; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 9436)
	(= (fuel plane1) 3003)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city3)
	(= (capacity plane2) 7696)
	(= (fuel plane2) 2765)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city2)
	(= (capacity plane3) 3050)
	(= (fuel plane3) 427)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at person1 city1)
	(at person2 city3)
	(at person3 city5)
	(at person4 city3)
	(at person5 city4)
	(at person6 city2)
	(at person7 city3)
	(at person8 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 978)
	(= (distance city0 city2) 794)
	(= (distance city0 city3) 640)
	(= (distance city0 city4) 980)
	(= (distance city0 city5) 700)
	(= (distance city1 city0) 978)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 793)
	(= (distance city1 city3) 526)
	(= (distance city1 city4) 987)
	(= (distance city1 city5) 691)
	(= (distance city2 city0) 794)
	(= (distance city2 city1) 793)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 884)
	(= (distance city2 city4) 666)
	(= (distance city2 city5) 888)
	(= (distance city3 city0) 640)
	(= (distance city3 city1) 526)
	(= (distance city3 city2) 884)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 806)
	(= (distance city3 city5) 987)
	(= (distance city4 city0) 980)
	(= (distance city4 city1) 987)
	(= (distance city4 city2) 666)
	(= (distance city4 city3) 806)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 814)
	(= (distance city5 city0) 700)
	(= (distance city5 city1) 691)
	(= (distance city5 city2) 888)
	(= (distance city5 city3) 987)
	(= (distance city5 city4) 814)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city0)
	(at person1 city4)
	(at person2 city0)
	(at person3 city2)
	(at person4 city2)
	(at person5 city2)
	(at person6 city3)
	(at person7 city2)
	(at person8 city3)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (board person7 plane2 city3)
   deleted: (at person7 city3)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 9
2. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 9
3. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 9
4. (refuel plane3 city2)
   changed: (fuel plane3) from 427 to 3050
   goals met: 1 of 9
5. (board person6 plane3 city2)
   deleted: (at person6 city2)
   added: (in person6 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 9
6. (zoom plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 0 to 1776, (fuel plane3) from 3050 to 1274
   goals met: 1 of 9
7. (board person3 plane3 city5)
   deleted: (at person3 city5)
   added: (in person3 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 9
8. (fly plane3 city5 city3)
   deleted: (at plane3 city5)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 1776 to 2763, (fuel plane3) from 1274 to 287
   goals met: 1 of 9
9. (refuel plane3 city3)
   changed: (fuel plane3) from 287 to 3050
   goals met: 1 of 9
10. (debark person6 plane3 city3)
   deleted: (in person6 plane3)
   added: (at person6 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 2 of 9
11. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2763 to 5427, (fuel plane1) from 3003 to 339
   goals met: 2 of 9
12. (zoom plane3 city3 city2)
   deleted: (at plane3 city3)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 5427 to 7195, (fuel plane3) from 3050 to 1282
   goals met: 2 of 9
13. (debark person3 plane3 city2)
   deleted: (in person3 plane3)
   added: (at person3 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 9
14. (fly plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 7195 to 9115, (fuel plane2) from 2765 to 845
   goals met: 4 of 9
15. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 9
16. (refuel plane2 city0)
   changed: (fuel plane2) from 845 to 7696
   goals met: 5 of 9
17. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 9115 to 12055, (fuel plane2) from 7696 to 4756
   goals met: 4 of 9
18. (board person5 plane2 city4)
   deleted: (at person5 city4)
   added: (in person5 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 4 of 9
19. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 12055 to 14053, (fuel plane2) from 4756 to 2758
   goals met: 4 of 9
20. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 9
21. (debark person7 plane2 city2)
   deleted: (in person7 plane2)
   added: (at person7 city2)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 9
22. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 9
23. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 14053 to 16435, (fuel plane2) from 2758 to 376
   goals met: 8 of 9
24. (fly plane3 city2 city4)
   deleted: (at plane3 city2)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 16435 to 17101, (fuel plane3) from 1282 to 616
   goals met: 8 of 9
25. (refuel plane1 city4)
   changed: (fuel plane1) from 339 to 9436
   goals met: 8 of 9
26. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 17101 to 21049, (fuel plane1) from 9436 to 5488
   goals met: 8 of 9
27. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 9
28. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 21049 to 24997, (fuel plane1) from 5488 to 1540
   goals met: 8 of 9
29. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
